benchmarks/runpod_h200sxm/benchmark_results_qwen3_32b_h200sxm/benchmark_qwen3_32b_h200sxm_run_1_TP4_DP2_CTX2048_C100_P100_O128.txt
BENCHMARK: benchmark_qwen3_32b_h200sxm_run_1_TP4_DP2_CTX2048_C100_P100_O128
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x755184347e20>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=2048, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='Qwen/Qwen3-32B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_qwen3_32b_h200sxm', result_filename='benchmark_qwen3_32b_h200sxm_run_1_TP4_DP2_CTX2048_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-37795dad-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-28 05:14:59 [datasets.py:612] Sampling input_len from [2048, 2048] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:03<06:32,  3.97s/it]
 56%|█████▌    | 56/100 [00:04<00:02, 19.37it/s]
100%|██████████| 100/100 [00:04<00:00, 24.40it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  4.10      
Total input tokens:                      204800    
Total generated tokens:                  12800     
Request throughput (req/s):              24.40     
Output token throughput (tok/s):         3123.48   
Peak output token throughput (tok/s):    9499.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          53099.24  
---------------Time to First Token----------------
Mean TTFT (ms):                          1623.84   
Median TTFT (ms):                        1773.99   
P99 TTFT (ms):                           2765.02   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          19.09     
Median TPOT (ms):                        17.94     
P99 TPOT (ms):                           30.07     
---------------Inter-token Latency----------------
Mean ITL (ms):                           19.09     
Median ITL (ms):                         10.49     
P99 ITL (ms):                            274.21    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4047.89   
Median E2EL (ms):                        4051.80   
P99 E2EL (ms):                           4084.38   
==================================================