benchmarks/runpod_h200sxm/benchmark_results_qwen3_32b_h200sxm/benchmark_qwen3_32b_h200sxm_run_1_TP8_DP1_CTX15000_C100_P100_O128.txt
BENCHMARK: benchmark_qwen3_32b_h200sxm_run_1_TP8_DP1_CTX15000_C100_P100_O128
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76b806067e20>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15000, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='Qwen/Qwen3-32B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_qwen3_32b_h200sxm', result_filename='benchmark_qwen3_32b_h200sxm_run_1_TP8_DP1_CTX15000_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-16b673a1-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-28 05:12:44 [datasets.py:612] Sampling input_len from [15000, 15000] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:18<30:51, 18.70s/it]
  5%|▌         | 5/100 [00:18<04:26,  2.81s/it]
 12%|█▏        | 12/100 [00:18<01:19,  1.10it/s]
 19%|█▉        | 19/100 [00:19<00:37,  2.13it/s]
 26%|██▌       | 26/100 [00:19<00:20,  3.55it/s]
 34%|███▍      | 34/100 [00:19<00:11,  5.75it/s]
 43%|████▎     | 43/100 [00:19<00:06,  9.05it/s]
 51%|█████     | 51/100 [00:19<00:03, 12.84it/s]
 61%|██████    | 61/100 [00:19<00:02, 18.98it/s]
 72%|███████▏  | 72/100 [00:19<00:01, 27.23it/s]
 85%|████████▌ | 85/100 [00:19<00:00, 38.92it/s]
100%|██████████| 100/100 [00:19<00:00,  5.03it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  19.87     
Total input tokens:                      1500000   
Total generated tokens:                  12800     
Request throughput (req/s):              5.03      
Output token throughput (tok/s):         644.24    
Peak output token throughput (tok/s):    5011.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          76141.11  
---------------Time to First Token----------------
Mean TTFT (ms):                          9024.22   
Median TTFT (ms):                        9062.07   
P99 TTFT (ms):                           17766.30  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          81.55     
Median TPOT (ms):                        81.77     
P99 TPOT (ms):                           143.69    
---------------Inter-token Latency----------------
Mean ITL (ms):                           81.55     
Median ITL (ms):                         19.54     
P99 ITL (ms):                            218.78    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          19380.88  
Median E2EL (ms):                        19446.92  
P99 E2EL (ms):                           19820.87  
==================================================